Repository: MahendraNeoGit/flutter_assignment
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appNameDev
source: Bahrain Credit App Dev
ar: تطبيق تسهيلات DEV

# appNameUat
source: Bahrain Credit App Uat
ar: تطبيق تسهيلات UAT

source: Show Card Details
ar: إظهار تفاصيل البطاقة

# pleaseAddYourActiveLiabilities
source: Please add your current active liabilities, if there’s any
ar: يرجى إضافة التزاماتك النشطة الحالية في حال وجودها

source: Payment Breakdown
ar: تفاصيل المدفوعات

source: Defer Installment
ar: تأجيل القسط

source: You will restart payment at
ar: ستقوم بإعادة الدفع في

source: Please upload your signature
ar: يرجى تحميل توقيعك

source: Signature
ar: توقيع

source: You will be charge for BHD 2.00 for card replacement. The amount will be applied to your selected credit card.
ar: سيتم فرض رسوم بقيمة 2.00 دينار بحريني لاستبدال البطاقة. سيتم تطبيق المبلغ على بطاقة الائتمان التي اخترتها.

source: BHD 2.00 will be charge on the credit card. Continue?
ar: سيتم خصم 2.00 دينار بحريني من بطاقة الائتمان. استمر؟

source: Simply sign on a plain white paper and upload it.
ar: عليك التوقيع على ورقة بيضاء عادية وتحميلها.

source: Please select how many month you want to delay
ar: يرجى تحديد عدد الشهور التي تريد تأخيرها

source: Your monthly payment will be
ar: ستكون دفعتك الشهرية بقيمة

source: How much would you like to borrow?
ar: كم تريد أن تقترض؟

source: I Can Pay Back Within
ar: يمكنني السداد في غضون

# removeLoanNickNameDesc
source: Are you sure to remove your loan nickname? Tap ‘Confirm’ to continue.
ar: هل أنت متأكد من إزالة لقب القرض الخاص بك؟ اضغط على 'تأكيد' للمتابعة.

# removeCardNickNameDesc
source: Are you sure to remove your credit card nickname? Tap ‘Confirm’ to continue.
ar: هل أنت متأكد من إزالة لقب بطاقتك الائتمانية؟ اضغط على 'تأكيد' للمتابعة.

# interestAmt
source: Interest amount
ar: مبلغ الفائدة

source: Interest rate
ar: سعر الفائدة

source: No. of instalments
ar: عدد الأقساط

# latePaymentChargesOnOutStandingAmt
source: Late payment charges on outstanding amount
ar: رسوم السداد المتأخرعلى المبلغ المستحق

source: LIABILITY TYPE
ar: نوع المسؤولية

# enterYourLoadOrCreditCardDetails
source: Enter your loan or credit card details
ar: أدخل تفاصيل القرض أو بطاقة الائتمان الخاصة بك

source: (Optional)
ar: (اختياري)

# yourLetterDeliveredToYourPreferredAddressWithin3BusinessDays
source: Your letter will be delivered to your preferred address within 3 business days.
ar: سيتم تسليم رسالتك إلى عنوانك المسجل في غضون 3 أيام عمل.

# selectLimitSetting
source: Select limit settings
ar: حدد إعدادات الحد الأقصى

# youHaveSuccessfullyRequestedSupplementaryCard
source: You have successfully requested for new supplementary card.
ar: لقد نجحت في طلب الحصول على بطاقة إضافية جديدة.

source: ADD
ar: اضافة

# monthlyAmt
source: MONTHLY AMOUNT
ar: المبلغ الشهري

# monthlyAmtFirstCharCapital
source: Monthly Amount
ar: المبلغ الشهري

# latest3MonthStatements
source: Latest 3-months statements
ar: آخر 3 أشهر

# pleaseUploadCopyOfLatest3MonthStatements
source: Please upload a copy of your latest 3 months bank statements
ar: يرجى تحميل نسخة من كشوف حسابك المصرفي لآخر 3 أشهر

# outStandingAmt
source: Outstanding Amount
ar: المبلغ المستحق

# imitiaz
source: IMTIAZ
ar: امتياز

# imitiazDesc
source: Get special offers with IMTIAZ Credit Card with many merchants across the world
ar: احصل على عروض خاصة مع بطاقة امتياز الائتمانية مع العديد من المتاجر في جميع أنحاء العالم

# dealsAroundYouDesc
source: Get 15% off on the every online purchase at Annada
ar: احصل على خصم 15٪ على كل عملية شراء عبر الإنترنت في أنادا

source: Increase card limit
ar: زيادة الحد الائتماني للبطاقة

source: Manage spending limits
ar: إدارة حدود الإنفاق

source: Manage card PIN
ar: إدارة رقم التعريف الشخصي للبطاقة

source: Replace my card
ar: استبدال بطاقتي

source: Replace card
ar: استبدال البطاقة

source: Request supplementary card
ar: طلب بطاقة إضافية

source: Request Letter
ar: رسالة الطلب

source: Loan Letter
ar: خطاب القرض

source: Outstanding Balance Letter
ar: خطاب الرصيد المستحق

source: Statement of Account
ar: كشف حساب

source: Semi Annual Statement
ar: كشف الحساب النصف سنوي

source: Clearance Letter
ar: خطاب براءة الذمة

source: Shared limit as your primary card
ar: الحد المشترك كبطاقتك الأساسية

source: Sub limit within primary card
ar: حد فرعي ضمن البطاقة الأساسية

source: Cancellation Letter
ar: خطاب الإلغاء

source: Cancel card
ar: إلغاء البطاقة

source: MANAGE CARD LIMIT
ar: إدارة حد البطاقة

# yourNewCardWillBeDeliveredToPreferredAddress3BusinessDay
source: Your new card will be delivered to your preferred address within 3 business days.
ar: سيتم تسليم بطاقتك الجديدة إلى عنوانك المسجل في غضون 3 أيام عمل.

source: Set new limit?
ar: تعيين حد أقصى جديد؟

source: You will receive your letter in your email.
ar: سوف تتلقى رسالتك في بريدك الإلكتروني.

# requestedLetterTo
source: We will send your requested letter to .
ar: سوف نرسل رسالتك المطلوبة إلى .

# increaseLimitBy
source: Are you sure you want to increase your card limit by
ar: هل أنت متأكد من رغبتك في زيادة حد بطاقتك بمقدار

# thisCancelYourCardContinuesAfterNewCardReceived
source: This will cancel your card. You can only continue spending when you received your new card.
ar: سيؤدي هذا إلى إلغاء بطاقتك. لا يمكنك الاستمرار في الإنفاق إلا عند استلام بطاقتك الجديدة.

source: Set new permanent limit
ar: تعيين حد دائم جديد

# pleaseEnterPermanentCardLimit
source: Please enter your new permanent card limit
ar: يرجى إدخال الحد الدائم الجديد لبطاقتك

# pleaseEnterTemporaryCardLimit
source: Please enter your new temporary card limit
ar: يرجى إدخال الحد الائتماني المؤقت الجديد لبطاقتك

source: Increase limit permanently
ar: زيادة الحد بشكل دائم

source: ENTER DESIRED AMOUNT
ar: أدخل المبلغ المطلوب

# increaseLimitPermanentlyDescription
source: Set a new permanent limit for your card. Additional documents will be required.
ar: ضع حدا دائما جديدا لبطاقتك. ستكون هناك حاجة إلى مستندات إضافية.

source: Increase limit temporarily
ar: زيادة الحد مؤقتا

# pleaseUploadReqDoc
source: Please upload the required documents below
ar: يرجى تحميل المستندات المطلوبة أدناه

source: Proof of Income
ar: إثبات الدخل

source: Upload
ar: الرفع

source: next
ar: التالي

# yourPaymentBeenDeclinedCheckWithBank
source: Your payments has been declined. Please check with your bank.
ar: تم رفض دفعاتك. يرجى مراجعة البنك الذي تتعامل معه.

# yourReachedMaximumAuthenticationAttempts
source: You have reached maximum authentication attempts. Please try again after 1 hour.
ar: لقد وصلت إلى الحد الأقصى لمحاولات المصادقة. يرجى المحاولة مرة أخرى بعد 1 ساعة.

source: You will be notified within 3 business days
ar: سيتم إعلامك في غضون 3 أيام عمل

# youHaveSuccessfullyChangedTemporaryCardLimit
source: You have successfully changed your temporary card limit.
ar: لقد نجحت في تغيير الحد المؤقت لبطاقتك.

# yourAppUnderReview
source: Your Application is Under Review
ar: طلبك قيد المراجعة

source: Set new temporary limit
ar: تعيين حد مؤقت جديد

source: Delivery
ar: التسليم

source: Self Collect
ar: الاستلام الذاتي

source: edit offer
ar: تعديل العرض

source: ADD NEW ADDRESS
ar: إضافة عنوان جديد

source: RELATIONSHIP
ar: العلاقة

source: CREDIT LIMIT SETTINGS
ar: إعدادات الحد الائتماني

# pleaseSelectPreferredCreditLimitSetting
source: Please select preferred credit limit settings
ar: يرجى تحديد إعدادات الحد الائتماني المفضلة

source: Select relationship
ar: حدد العلاقة

# whatIsRelationShipWithCardHolder
source: What is your relationship with the card holder?
ar: ما هي علاقتك بحامل البطاقة؟

# yourCardPickUpWithin3Day
source: Your new card will be ready for pickup within 3 business days.
ar: ستكون بطاقتك الجديدة جاهزة للاستلام في غضون 3 أيام عمل.

# youHaveSuccessfullyAppliedReplacementCard
source: You have successfully applied for a new replacement card.
ar: لقد تقدمت بنجاح بطلب للحصول على بطاقة بديلة جديدة.

# pleaseSelectYourPreferredBranch
source: Please select your preferred branch. We’ll sort the rest for you.
ar: يرجى اختيار الفرع المفضل لديك. سوف نجهز الباقي لك

# pleaseSelectYourPreferredAddress
source: Please select your preferred address. We’ll sort the rest for you.
ar: يرجى تحديد عنوانك المفضل. سوف نجهز الباقي لك

# getCardDeliveredAtYourDoorStep
source: Get your card delivered right at your doorstep
ar: احصل على بطاقتك مباشرة على عنوانك

# howWouldLikeToRequestNewCreditCard
source: How would like to receive your new credit card?
ar: كيف ترغب في الحصول على بطاقتك الائتمانية الجديدة؟

# proofOfIncomeDescription
source: If you receive a salary, upload your job certificate or your salary slip
ar: إذا كنت تتلقى راتبا، قم بتحميل شهادة الوظيفة أو كشف راتبك

# increaseLimitTemporarilyDescription
source: Your card limit will be increased temporarily and reset on the next cycle
ar: سيتم زيادة حد بطاقتك مؤقتا وإعادة تعيينه في الدورة التالية

# applyText
source: Apply
ar: تطبيق

# profileMobileNumber
source: Mobile Number
ar: رقم الجوال

source: Manage Address
ar: إدارة العنوان

# helloLetGetYourAccountSet
source: Hello! Let’s get your account set
ar: مرحبًا بك ! هيا نجهز حسابك

source: Save Changes
ar: حفظ التغييرات

source: Edit Address
ar: تعديل العنوان

source: NickName
ar: اللقب

source: country
ar: البلد

source: BUILDING NAME / NO
ar: اسم المبنى / الرقم

source: STREET NAME
ar: اسم الشارع

source: city
ar: المدينة

source: Select from Library
ar: اختر من المعرض

source: Remove Photo
ar: إزالة الصورة

source: Take Photo
ar: التقاط صورة

source: Please select your action
ar: يرجى تحديد الإجراء الخاص بك

source: Push Notifications
ar: الاشعارات

source: Transactions
ar: المعاملات

source: Money in, our and status of your transaction
ar: المال الموجود في، وحالة معاملتك

source: Statements
ar: كشف الحساب

# dealsAndRewards
source: Deals & Rewards
ar: العروض والمكافآت

source: New offers, rewards redemptions
ar: عروض جديدة ومكافآت

source: Remove address
ar: حذف العنوان

source: Cards
ar: البطاقات

source: Loans
ar: قروض

source: Insurances
ar: التامينات

source: Apply Now
ar: قدم الآن

source: Discover
ar: اكتشف

source: NAME AS PER ID
ar: الاسم طبقا لبطاقة الهوية

source: DATE OF BIRTH
ar: تاريخ الميلاد

source: ID EXPIRY
ar: انتهاء صلاحية الهوية

source: ID ISSUER
ar: جهة إصدار الهوية

source: GENDER
ar: الجنس

source: nationality
ar: الجنسية

source: occupation
ar: الوظيفة

source: Other Nationality
ar: جنسية أخرى

source: annual income
ar: الدخل السنوي

source: employer name
ar: اسم صاحب العمل

source: Additional Income
ar: دخل إضافي

source: Please answer the questions below
ar: يرجى الإجابة على الأسئلة أدناه

source: employer country
ar: بلد صاحب العمل

source: ANNUAL
ar: سنوي

source: Are you a U.S. citizen?
ar: هل أنت مواطن أمريكي؟

source: Are you a U.S. Tax Resident?
ar: هل لديك سجل ضريبي في الولايات المتحدة؟

source: Were you born in the U.S.?
ar: هل ولدت في الولايات المتحدة؟

source: Do you have a permanent residence status permission in another country?
ar: هل لديك تصريح إقامة دائمة في بلد آخر؟

# greenCardHolder
source: (e.g. Green Card Holder)
ar: (على سبيل المثال جرين كارد)

# areYouOrAnyFirstDegreeRelativeAPoliticallyExposedPerson
source: Are you or any first degree relative a Politically Exposed Person (P.E.P)?
ar: هل أنت أو أي قريب من الدرجة الأولى لديك شخص مكشوف سياسيا (P.E.P)؟

source: employer city
ar: مدينة صاحب العمل

source: What is P.E.P?
ar: ما هو الشخص المكشوف سياسيا ؟

source: Name of P.E.P
ar: اسم الشخص المكشوف سياسيا

source: Role of P.E.P
ar: دور الشخص المكشوف سياسيا ؟

# additionalIncomePopUpDesc2
source: additional income instead of monthly income to get your credit card right away.
ar: دخل إضافي بدلا من الدخل الشهري للحصول على بطاقتك الائتمانية على الفور.

source: Add Income
ar: إضافة دخل

# additionalIncomePopUpDesc1
source: Make sure you enter your
ar: تأكد من إدخال

source: employer phone number
ar: رقم هاتف صاحب العمل

source: Do you have additional sources of income?
ar: هل لديك مصادر دخل إضافية؟

source: Are you married?
ar: هل أنت متزوج؟

# letFillUpYourEmploymentDetails
source: Let’s fill up your employment details
ar: إملأ تفاصيل التوظيف الخاصة بك

source: What is your employment status?
ar: ما هو وضعك الوظيفي؟

source: Are you the beneficial owner of the account?
ar: هل أنت مالك للحساب؟

source: Do you have any other nationality?
ar: هل لديك أي جنسية أخرى؟

# letAnswerYourPersonalDetails
source: Let’s answer your personal details
ar: أجب على التفاصيل الشخصية الخاصة بك

source: Please confirm your ID details
ar: يرجى تأكيد تفاصيل الهوية الخاصة بك

source: Please select your desired card limit
ar: يرجى تحديد الحد الائتماني للبطاقة

# removeAddressSubtitle
source: Are you sure you want to remove {String} from your address list? This action can’t be undone.
ar: هل تريد بالتأكيد إزالة {String} من قائمة العناوين الخاصة بك؟ لا يمكن التراجع عن هذا الإجراء.

# letAccountSet
source: Hello! Let’s get your account set
ar: مرحبًا بك! هيا نجهز حسابك

# whereDoCurrentlyLive
source: Where do you currently live?
ar: أين تعيش حاليا؟

source: Please enter or locate
ar: الرجاء إدخال أو تحديد موقع

source: Change email address
ar: تغيير عنوان البريد الإلكتروني

# agreeToTC
source: I agree to the Terms & Conditions and the Privacy Policy
ar: أوافق على الشروط والأحكام وسياسة الخصوصية

source: Privacy Policy
ar: سياسة الخصوصية

source: employment status
ar: الحالة الوظيفية

source: Full-Time Employee
ar: موظف بدوام كامل

source: Student
ar: طالب

source: Retired
ar: متقاعد

source: Unemployed
ar: لا يعمل

source: Business Owner
ar: صاحب العمل

source: You have successfully updated your address
ar: لقد قمت بتحديث عنوانك بنجاح

source: Relationship with P.E.P
ar: العلاقة مع الأشخاص المكشوفين سياسياً

source: Proof of Address
ar: إثبات العنوان

source: Proof of Additional Nationality
ar: إثبات الجنسية الإضافية

source: Please upload a copy of your passport
ar: يرجى تحميل نسخة من جواز سفرك

source: Latest 3-months statements
ar: بيان آخر 3 أشهر

source: Would you like to have the physical credit card?
ar: هل ترغب في الحصول على بطاقة الائتمان الفعلية؟

source: Please upload your salary slip as a proof of your income
ar: يرجى تحميل كشف راتبك كدليل على دخلك

source: Please upload a copy of your latest 3 months bank statements
ar: يرجى تحميل نسخة من كشوف حسابك المصرفي لآخر 3 أشهر

# confirmFourDigitPin
source: Please confirm your 4-digit PIN
ar: يرجى تأكيد رقم التعريف الشخصي المكون من 4 أرقام

source: Replace my digital card
ar: استبدال بطاقتي الرقمية

source: Request physical card
ar: طلب بطاقة فعلية

source: Current Installment Date
ar: تاريخ القسط الحالي

source: Enter your PIN
ar: أدخل رقم التعريف الشخصي الخاص بك

source: duration
ar: المدة

# nosOfMonthToDelay
source: Number of month to delay
ar: عدد أشهر التأخير

source: accept
ar: قبول

source: decline
ar: رفض

source: Reason for replace
ar: سبب الاستبدال

# areYouSureToAcceptLimitWithTemporaryDurationOffered
source: Are you sure to accept new limit with temporary duration offered?
ar: هل أنت متأكد من قبول حد جديد مع وجود مدة مؤقتة؟

# pleaseConsiderNewTemporaryCardLimit
source: Please consider the new temporary limit
ar: يرجى مراعاة الحد المؤقت الجديد

source: New temporary limit
ar: حد مؤقت جديد

# scrollToSetDate
source: Scroll to set {scrollToSetDate}
ar: قم بالتمرير لتعيين {التاريخ}

source: New Installment Date
ar: تاريخ القسط الجديد

# youWillBeRestartPayingOnDate
source: You will restart payment on {date}
ar: ستعيد الدفع في {الدفع}

# signatureUploadDescription
source: Simply sign on a plain white paper and upload it.
ar: ما عليك سوى التوقيع على ورقة بيضاء عادية وتحميلها.

# pleaseSelectHowManyMonthToDelay
source: Please select how many month you want to delay
ar: يرجى تحديد عدد الشهور التي تريد تأخيرها

# pleaseContactBankIfLiabilitiesIncorrect
source: Please contact your bank if these liabilities are not yours or incorrect.
ar: يرجى الاتصال بالمصرف الذي تتعامل معه إذا لم تكن هذه الالتزامات ملكك أو غير صحيحة.

# seemsLikeActiveLoanCreditCardPleasConfirm
source: Seems like you have an active loans/credit card at the moment. Please confirm.
ar: يبدو أن لديك بطاقة قروض / ائتمان نشطة في الوقت الحالي. يرجى التأكيد.

source: Set your supplementary card limit
ar: تعيين حد البطاقة الإضافية

source: You have successfully applied for a new virtual card.
ar: لقد تقدمت بنجاح للحصول على بطاقة افتراضية جديدة

source: You have successfully applied for a physical card.
ar: لقد تقدمت بطلب للحصول على بطاقة فعلية بنجاح.

# yourNewCardWillDeliveredBusinessDays
source: Your new card will be delivered to your preferred address within 3 business days.
ar: سيتم تسليم بطاقتك الجديدة إلى عنوانك المسجل في غضون 3 أيام عمل.

# yourNewVirtualCardNumbersAndDetailsUpdatedBusinessDays
source: Your new virtual card numbers and details will be updated as new card within 3 business days.
ar: سيتم تحديث أرقام وتفاصيل بطاقتك الافتراضية الجديدة كبطاقة جديدة في غضون 3 أيام عمل.

# physicalCard
source: Physical & Digital Card
ar: البطاقة الفعلية

# physicalCardDesc
source: Get a hold of our physical card to keep it in your wallet
ar: احصل على بطاقتنا الفعلية للاحتفاظ بها في محفظتك

source: Digital Card
ar: البطاقة الرقمية

# digitalCardDesc
source: Same function, but no worries the card could lose or damaged but always available in your mobile
ar: نفس الوظائف بدون القلق فقدان البطاقة أو تلفها

# cardReviewed
source: Your credit card has been approved. Please review and confirm.
ar: تمت الموافقة على بطاقة الائتمان الخاصة بك. يرجى المراجعة والتأكيد.

# loanReviewed
source: Your loan application has been approved. Please review and confirm.
ar: تمت الموافقة على طلب القرض الخاص بك. يرجى المراجعة والتأكيد.

source: Credit Limit
ar: الحد الائتماني

# interestRateL
source: Interest Rate
ar: سعر الفائدة

source: Monthly Minimum Payment
ar: الحد الأدنى للدفع الشهري

# decla1
source: I accept the terms and offers including the
ar: أوافق على الشروط والعروض بما في ذلك

# physicalDigital
source: Would you like to use physical or digital card?
ar: هل ترغب في استخدام بطاقة فعلية أو رقمية؟

# selectNameOnCard
source: Please select name to be appear on your card
ar: يرجى اختيار الاسم ليظهر على بطاقتك

# letsGetSignature
source: Now, let’s get your signature
ar: الآن نود الحصول على توقيعك

# setPinForCard
source: Let’s setup PIN for your new card
ar: هيا نقوم بإعداد رقم التعريف الشخصي لبطاقتك الجديدة

# reviewConfirmDetail
source: Please review and confirm all details below
ar: يرجى مراجعة وتأكيد جميع التفاصيل أدناه

# reviewTermsConfirm
source: I confirm and agree that all details are correct
ar: أؤكد وأوافق على أن جميع التفاصيل صحيحة

# creditCardApplicationSuccess
source: Your Credit Card Application is Successful
ar: تم قبول طلب بطاقتك الائتمانية

# creditCardAppSuccessDesc
source: You will receive your physical card within 5 business days. Please contact us if you did not receive your card.
ar: سوف تتلقى بطاقتك الفعلية في غضون 5 أيام عمل. يرجى الاتصال بنا إذا لم تستلم بطاقتك.

# beforeWeBeginScanBahraniId
source: Before we begin, verify yourself by scanning your Bahraini ID.
ar: قبل أن نبدأ، تحقق من هويتك عن طريق مسح بطاقة الهوية البحرينية الخاصة بك.

# confirmDetailTC
source: I confirm and agree that all my ID details are correct
ar: أؤكد وأوافق على أن جميع تفاصيل هويتي صحيحة

# paymentRequired
source: Payment required. Continue?
ar: مطلوب الدفع. استمر؟

# paymentRequiredDesc
source: Payments are required to complete the request of this letter.
ar: المدفوعات مطلوبة لإكمال طلب هذه الرسالة.

# verifyId
source: Verify the person by scanning their Bahraini ID. Proceed when you’re ready.
ar: تحقق من هوية الشخص عن طريق مسح بطاقة الهوية البحرينية الخاصة به. تابع عندما تكون مستعدا.

source: Cardholder Name
ar: اسم حامل البطاقة

source: Minimum Payment
ar: الحد الأدنى للدفع

# invalidEmail
source: Enter valid email
ar: أدخل بريد إلكتروني صحيح

source: Primary Address
ar: العنوان الرئيسي

source: Add Address
ar: إضافة عنوان

source: Address updated
ar: تم تحديث العنوان

# addressUpdatedSuccess
source: You have successfully updated your address
ar: لقد قمت بتحديث عنوانك بنجاح

# mobileNoUpdated
source: Mobile number updated
ar: تم تحديث رقم الجوال

# mobileNoUpdatedSuccess
source: You have successfully changed your mobile number
ar: لقد نجحت في تغيير رقم جوالك

source: Email address updated
ar: تم تحديث عنوان البريد الإلكتروني

# emailAddressUpdatedSuccess
source: You have successfully changed your email address
ar: لقد نجحت في تغيير عنوان بريدك الإلكتروني

source: Address removed
ar: تمت إزالة العنوان

# addAddressSuccess
source: Address added successfully
ar: تمت إضافة العنوان بنجاح

# addressRemovedSuccess
source: You have successfully removed your address
ar: لقد نجحت في إزالة عنوانك

source: Profile photo updated
ar: تم تحديث صورة الملف الشخصي

# profilePhotoUpdatedDesc
source: You have successfully changed your profile photo
ar: لقد نجحت في تغيير صورة ملفك الشخصي

source: Profile photo removed
ar: تمت إزالة صورة الملف الشخصي

source: Please Add Annual Amount
ar: يرجى إضافة المبلغ السنوي

source: Annual Amount
ar: المبلغ السنوي

# profilePhotoRemovedDesc
source: You have successfully removed your profile photo
ar: تم إزالة صورة ملفك الشخصي بنجاح

source: Customer Category
ar: فئة العميل

source: Joining Date
ar: تاريخ الانضمام

source: Residential City
ar: المدينة السكنية

source: Sector
ar: قطاع

source: Industry
ar: صناعة

source: Name On Card
ar: الاسم على البطاقة

# enterNewEmailAddress
source: Enter your new email address
ar: أدخل عنوان بريدك الإلكتروني الجديد

# enterNewMobileNo
source: Enter your new mobile number
ar: أدخل رقم جوالك الجديد

source: User
ar: المستخدم

source: No. of installments
ar: عدد الأقساط

source: Monthly Payments
ar: الدفعات الشهرية

source: Late Payment Charges
ar: رسوم السداد المتأخر

source: Bank Account
ar: حساب بنكي

source: Select Bank Account
ar: اختر حساب بنكي

source: enter iban
ar: أدخل رقم الحساب المصرفي الدولي (IBAN)

source: Payment Schedule
ar: جدول الدفع

source: Bank Account For Disbursement
ar: حساب بنكي للصرف

source: Please select bank for loan disbursement
ar: يرجى اختيار البنك لصرف القرض

# youLoanApplicationIsSuccessfull
source: Your loan application is approved
ar: تمت الموافقة على طلب القرض الخاص بك

# youLoanApplicationIsSuccessfullDescription
source: You should receive your loan amount into your bank account within 24 Hours.
ar: يجب أن تتلقى مبلغ القرض الخاص بك في حسابك المصرفي في غضون 24 ساعة.

# applyForCard
source: Apply for credit card
ar: التقدم بطلب للحصول على بطاقة ائتمان

source: Apply for loan
ar: التقدم بطلب للحصول على قرض

source: Points
ar: النقاط

source: History
ar: التاريخ

source: Loyalty Points
ar: نقاط الولاء

source: Points History
ar: سجل النقاط

source: REDEEM NOW
ar: استبدل الآن

source: Total Points Earned
ar: مجموع النقاط المكتسبة

source: Total Points Redeemed
ar: إجمالي النقاط المستبدلة

source: Points Expiring Next Month
ar: تنتهي صلاحية النقاط الشهر المقبل

source: Points Expiring Next 3 Month
ar: النقاط التي تنتهي صلاحيتها في ال 3 أشهر القادمة

source: Points Redemption
ar: استبدال النقاط

source: How much would you like to redeem?
ar: كم تريد أن تسترد؟

source: Type of redemption
ar: نوع الاسترداد

source: Gulf air account number
ar: رقم حساب طيران الخليج

source: Redeem to
ar: استبدل إلى

source: Cashback
ar: كاش باك

source: Transfer to Gulf Air
ar: نقل إلى طيران الخليج

source: Entered points are equivalent to
ar: النقاط المدخلة تعادل

source: You point redemption is successful
ar: تم استرداد النقاط بنجاح

source: You point has been claimed and reflected on your card balance.
ar: تمت المطالبة بالنقطة الخاصة بك واضافتها على رصيد بطاقتك.

source: Point Redemption
ar: استبدال النقاط

source: Filter
ar: الفرز

source: pts
ar: النقاط

source: Please review and confirm details below
ar: يرجى مراجعة وتأكيد التفاصيل أدناه

source: Points Redeem
ar: استبدال النقاط

source: Points Claimed
ar: النقاط المطالب بها

source: Monthly Amount
ar: المبلغ الشهري

source: Please Add Monthly Amount
ar: يرجى إضافة المبلغ الشهري

source: Upload More
ar: تحميل المزيد

source: House/building number
ar: رقم المنزل / المبنى

source: postcode
ar: الرمز البريدي

source: Let’s answer your employment details
ar: أجب على تفاصيل التوظيف الخاصة بك

source: POSITION
ar: الوظيفة
