Repository: MahendraNeoGit/flutter_assignment
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Flat
ar: الشقة

source: Building
ar: المبنى

source: Road Number
ar: رقم الطريق

source: Block number
ar: رقم المجمع

source: Please confirm your primary address
ar: يرجى تأكيد عنوانك الأساسي

source: No. of Payments
ar: عدد المدفوعات

source: First Installment
ar: القسط الأول

source: First Installment Date
ar: تاريخ القسط الأول

source: Last Installment
ar: القسط الأخير

source: Last Installment Date
ar: تاريخ آخر قسط

# chargesAndFees
source: "Charges & Fees"
ar: الرسوم والمصاريف

source: and
ar: و

source: select due date
ar: حدد تاريخ الاستحقاق

source: One Time Password
ar: كلمة المرور لمرة واحدة

# youWillReceiveOTP
source: You will receive an OTP for you to be able to access the agreement.
ar: ستتلقى كلمة مرور لمرة واحدة لتتمكن من الوصول إلى الاتفاقية.

source: okay
ar: موافق

source: Monthly
ar: شهري

source: Interest
ar: الفائدة

source: Principle
ar: المبدأ

# monthlyIncome
source: monthly gross income
ar: الدخل الإجمالي الشهري

# searchName
source: Search Employer Name
ar: البحث عن اسم صاحب العمل

source: Search
ar: بحث

# joiningDateShouldMore
source: Joining date should be before 6 months
ar: يجب أن يكون تاريخ الانضمام قبل 6 أشهر

# applicationDeclined
source: Your application has been declined
ar: تم رفض طلبك

# notEligibleToProceedWithApplication
source: We are sorry. Unfortunately, your application does not meet the minimum requirements.
ar: للأسف لا يفي طلبك بالحد الأدنى من المتطلبات.

# submittedForReview
source: Your application has been submitted for review
ar: تم تقديم طلبك للمراجعة

# applicationRequiresReview
source: Seems that your application requires review. Don’t worry you can track your application approval from your Dashboard.
ar: يبدو أن طلبك يتطلب المراجعة. لا تقلق، يمكنك تتبع الموافقة على طلبك من لوحة التحكم الخاصة بك.

source: go to dashboard
ar: انتقل إلى لوحة التحكم

# applicationSubmittedSuccessfully
source: Your application has been submitted successfully
ar: تم تقديم طلبك بنجاح

# visitBranchToCompleteApplication
source: Please visit our branch to complete your application.
ar: يرجى زيارة فرعنا لإكمال طلبك.

source: Select Branch
ar: اختر الفرع

source: Application ID
ar: هوية التطبيق

source: In Process
ar: قيد التنفيذ

source: Approved
ar: تم الموافقة عليه

# refIdWithSymbol
source: REF ID :
ar: رقم العقار :

source: Hello
ar: مرحبًا

source: ONGOING APPLICATION
ar: التطبيق المستمر

# invalidNameSelection
source: The name selected should not be more than 23 characters.
ar: يجب ألا يزيد الاسم المحدد عن 23 حرفا.

source: Reviewed
ar: استعراض

source: Connect Bank Account
ar: ربط الحساب المصرفي

source: Connect Another Bank
ar: ربط بنك آخر

source: OR
ar: أو

source: Connected
ar: متصل

source: Bank
ar: البنك

source: Client Consent
ar: موافقة العميل

source: Close
ar: اغلاق

# iAgreeWahtiqConsent
source: I agree to provide my consent to The Benefit Company to collect, retain, process, update, disclose and transfer this information for eKYC purposes and that I have read the
ar: أوافق على تقديم موافقتي لشركة البحرين للتسهيلات التجارية لجمع هذه المعلومات والاحتفاظ بها ومعالجتها وتحديثها والكشف عنها ونقلها لأغراض 'إعرف عمليك وأنني قد قرأت

# letConnectYourSalarySata
source: Let’s connect your salary data
ar: لنقم بربط بيانات راتبك

# agreeVerifyTextForSalaryData
source: I agree to provide my consent to The Bahrain Credit Company to collect, retain, process, update, disclose and transfer this information for proof of income purposes
ar: أوافق على التصريح لشركة البحرين للتسهيلات التجارية لجمع هذه المعلومات والاحتفاظ بها ومعالجتها وتحديثها والإفصاح عنها ونقلها لأغراض إثبات الدخل

source: Branches
ar: الفروع

source: Please confirm your salary details
ar: يرجى تأكيد تفاصيل راتبك

source: I confirm and agree that all my salary details are correct
ar: أؤكد وأوافق على أن جميع تفاصيل راتبي صحيحة

source: enter otp
ar: أدخل كلمة المرور لمرة واحدة

source: Ministry Name
ar: اسم الوزارة

source: Basic salary
ar: الراتب الأساسي

source: allowances
ar: البدلات

source: deductions
ar: الخصومات

source: Net Salary
ar: صافي الراتب

source: Connect Salary Data
ar: ربط بيانات الرواتب

# language
source: عربي
ar: English

# changeLanguageTo
source: Do you want to change the language from English to Arabic
ar: هل تريد تغيير اللغة من العربية إلى الإنجليزية

# appName
source: Bahrain Credit App
ar: تطبيق تسهيلات البحرين

source: REGISTER
ar: تسجيل

# welcomeToBCFC
source: Welcome to BCFC Digital
ar: أهلا بك في تسهيلات البحرين

source: PERSONAL (CPR)
ar: شخصي (رقم الهوية)

source: BUSINESS (CR)
ar: تجاري (سجل تجاري)

source: ID NUMBER
ar: رقم الهوية

source: Please enter ID number
ar: يرجى ادخال رقم الهوية

source: LOGIN
ar: تسجيل الدخول

source: QUICK PAY
ar: الدفع/السريع

source: CONTACT US
ar: اتصل بنا

source: LOCATE US
ar: فروعنا

# discoverVarietyOfOffersAndProduct
source: Discover variety of offers & product
ar: اكتشف عروضنا و منتجاتنا المتنوعة

source: For Her
ar: فور هير

source: Sponsored
ar: إعلان

source: Deals Around You
ar: العروض تناسبك

source: View All
ar: عرض الكل

source: Insure Me
ar: احصل على تأمين

# getLoan
source: Get A Loan
ar: احصل على قرض

source: Offers
ar: العروض

source: FILTER BY CARD
ar: فلتر حسب البطاقة

source: APPLY
ar: تقدم بطلب

source: Cancel
ar: إلغاء

# enterValidOtp
source: Please enter valid otp
ar: صحيح OTP الرجاء ادخال

# enterYourIDNumber
source: Please enter your ID number
ar: الرجاء ادخال رقم هويتك

source: Please enter
ar: يرجى الإدخال

source: PRODUCT TYPE
ar: نوع المنتج

source: Please select
ar: يرجى الإختيار

source: Credit Card
ar: بطاقة الإئتمان

source: Loan
ar: قرض

source: INQUIRE
ar: استفسر

# last4Digit
source: card last 4-digit
ar: أخر 4 أرقام من البطاقة

# whatWouldYouLikeToPayDescription
source: You can proceed with payment or inquire the amounts. You will be required to provide your mobile number for a verification purpose.
ar: يمكنك المضي في الدفع أو الاستفسار عن المبالغ. وسوف يتطلب منك إدخال رقم هاتفك للتحقق

source: What would you like to pay?
ar: ماذا تريد أن تدفع

source: YOU MIGHT LIKE
ar: ربما تحب

source: Contact Us
ar: اتصل بنا

source: Reach us via
ar: تواصل معنا عبر

source: Follow us on
ar: تابعنا على

# callOn
source: Call {String}
ar: اتصل

source: ACCOUNT NUMBER
ar: رقم الحساب

source: ID TYPE
ar: نوع الهوية

source: CPR
ar: رقم الهوية

# makeSureBrightPlace
source: Make sure you’re in a bright place
ar: تأكد من إضاءة محيطك

# verifyMobileNumber
source: Please enter and verify your new mobile number
ar: الرجاء ادخال وتأكيد رقم هاتفك الجديد

source: MOBILE NUMBER
ar: رقم الهاتف

# welcomeToAccountSet
source: Welcome! Let’s get your account set
ar: مرحبًا! دعنا نجهز حسابك

# verifyYourBahrainiID
source: Verify yourself by scanning your Bahraini ID. Proceed when you’re ready.
ar: أكد هويتك عن طريق مسح بطاقة هويتك البحرينية، واستمر عندما تكون جاهزا

source: How much would you like to pay?
ar: كم تريد أن تدفع؟

# enter4DigitPinToLogin
source: Enter your 4-digit PIN to login
ar: أدخل رقمك السري الذي يتألف من 4 أرقام لتسجيل الدخول

source: Welcome back,
ar: مرحبا بعودتك

source: Forgot PIN?
ar: نسيت الرقم السري؟

source: BACK TO HOME
ar: العودة الى الصفحة الرئيسية

# yourAccountSuspended
source: Your account is suspended.
ar: تم ايقاف حسابك

# yourAccountSuspendedDescription
source: Your account is temporary suspended. You may try logging in again after 10 minutes.
ar: تم ايقاف حسابك مؤقتا. يمكنك محاولة الدخول بعد 10 دقائق

source: PAY
ar: ادفع

source: Payment Method
ar: طريقة الدفع

source: Benefit Gateway
ar: الدفع عن طريق بنيفت

source: Your payment is success!
ar: تم الدفع بنجاح

source: Amount Paid
ar: المبلغ المدفوع

source: Date
ar: التاريخ

source: Time
ar: الوقت

source: Ref ID
ar: الرقم العملية

source: DONE
ar: تم

source: Mariam Rashid
ar: مريم راشد

source: SHARE RECEIPT
ar: مشاركة الايصال

# continueText
source: CONTINUE
ar: استمر

source: VERIFY
ar: تحقق

# resendIn
source: Resend in {resendTime}
ar: إعادة الإرسال (وقت اعادة الأإرسال)

# pleaseCreatePin
source: Next, let’s create your 4-digit PIN
ar: الآن، دعنا نعد رقمك السري الذي يتالف من 4 أرقام

# pleaseConfirmPin
source: Please confirm your 4-digit PIN
ar: الرجاء التأكد من الرقم السري الذي يتألف من 4 أرقام

source: CHANGE MOBILE NUMBER
ar: تعديل رقم الهاتف

# enterDigitCode
source: Enter 4-digit code sent
ar: أدخل الرمز المرسل على

source: MAYBE LATER
ar: ربما لاحقا

# seamlessExperienceBiometricLogin
source: For more seamless experience, please enable the biometric login
ar: لتجربة سلسلة، الرجاء تفعيل طريقة الدخول بالبايومترية

# pinAuthentication
source: You can login using the PIN and authenticate any account activity.
ar: يمكنك الدخول باستخدام رقمك السري/تأكيد أي نشاط في الحساب

source: ENABLE
ar: تفعيل

source: ENABLE NOW
ar: إبدأ التفعيل الآن

source: My Loans
ar: قروضي

source: FORGOT PIN?
ar: نسيت الرقم السري؟

# enter4DigitPinLogin
source: Enter your 4-digit PIN to login
ar: أكد هويتك عن طريق مسح بطاقة هويتك البحرينية، واستمر عندما تكون جاهزا

# createNewPin
source: Let’s create your new PIN
ar: إنشاء رقم سري جديد

# createNewPinDesc
source: You can enter your new 4-digit PIN. Make sure you remember this new one.
ar: يمكنك إدخال رقم السري الجديد المكون من 4 أرقام/وتأكد من تذكر الرقم

# confirmNewPin
source: Please confirm your PIN
ar: الرجاء تأكيد رقمك السري

# confirmNewPinDesc
source: Confirm your new 4-digit PIN. Make sure you remember this new one.
ar: قم بتأكيد رقمك السري المكون من 4 أرقام/تأكد من تذكر الرقم الجديد

source: Error
ar: خطأ

# pinNotMatch
source: Pin doesn't match
ar: الرقم السري غير مطابق

source: Biometric Login
ar: الدخول بالطريقة بالبايومترية

# enableBiometricLoginDescriptionAndroid
source: Scan your finger to log in
ar: الدخول بالبصمة

# enableBiometricLoginDescriptionIos
source: Scan your face to log in
ar: الدخول ببصمة الوجه

source: My Cards
ar: بطاقاتي

source: View Virtual Card
ar: البطاقة الافتراضية

source: Transaction History
ar: المعاملات السابقة

source: MORE ACTIONS
ar: المزيد/الإجراءات

source: MANAGE PIN
ar: إدارة الرقم السري

source: FREEZE CARD
ar: تجميد/البطاقة

source: UNFREEZE CARD
ar: رفع التجميد/البطاقة

source: PAY CARD
ar: ادفع/البطاقة

source: EXPIRY
ar: الانتهاء

source: Upcoming Payment
ar: الدفعة القادمة

source: CARDS FOR YOU
ar: بطاقات لك

source: Payment history
ar: تاريخ المدفوعات

# cardLoan
source: Car Loan
ar: قرض السيارات

source: OUTSTANDING Balance
ar: الرصيد المستحق

# paymentDueOn
source: Your payment due on
ar: رصيدك مستحق في

source: View Loan Details
ar: راجع تفاصيل القرض

source: VIEW MORE
ar: اطلع على المزيد

# actions
source: MORE ACTIONS
ar: المزيد من الإجراءات

source: Enter card nickname
ar: أدخل اسم للبطاقة

source: Card Nickname
ar: اسم البطاقة

source: SAVE
ar: احفظ

source: REMOVE NICKNAME
ar: حذف اسم البطاقة

source: DOWNLOAD STATEMENT
ar: تحميل كشف الحساب

source: DOWNLOAD PDF
ar: تحميل/pdf

source: SEND TO EMAIL
ar: ارسل للبريد الإلكتروني

source: SHARE VIA
ar: ارسل عبر

source: Download card statement
ar: تحميل كشف الحساب

source: Add nickname
ar: أضف اسم القرض

# loanAmt
source: Loan Amount
ar: مبلغ القرض

# financingAmt
source: Financing Amount
ar: مبلغ التمويل

# loanDetail
source: Loan Details
ar: تفاصيل القرض

source: Monthly Payment
ar: القسط الشهري

source: Insurance Premium
ar: مبلغ التأمين

source: Account Disbursement
ar: صرف الحساب

source: Go back
ar: رجوع

source: Balance
ar: الرصيد

# upComingPayment
source: Upcoming Payments
ar: المدفوعات القادمة

# profileSettings
source: Profile and settings
ar: الملف الشخصي والإعدادت

# profileSettingsDescription
source: Tap to view more on your profile and account settings.
ar: اضغط للاطلاع على الملف الشخصي وإعدادات الحساب

# upComingPaymentDescription
source: Tap to view your payment details or swipe left to make a quick payment
ar: اضغط للاطلاع على المزيد من تفاصيل مدفوعاتك/اسحب يساراً للدفع السريع

source: Enter your 4-digit PIN
ar: أدخل رقمك السري من 4 أرقام

# pleaseEnter4DigitPinToProceed
source: Please authenticate with your 4-digit PIN to proceed
ar: الرجاء التأكيد بادخال رقمك السري من 4 أرقام للاستمرار

source: Change card PIN
ar: تغيير الرقم السري

source: Reissue card PIN
ar: إعادة إصدار الرقم السري

# managePinBottom
source: MANAGE PIN
ar: إدارة الرقم السري

# pleaseCurrentPin
source: Enter your current PIN
ar: ادخل رقمك السري الحالي

# pleaseNewPin
source: Enter your new PIN
ar: ادخل رقمك السري الجديد

# pleaseEnterCurrentPin
source: Please enter your current 4-digit PIN before setting up a new one
ar: الرجاء إدخال رقمك السري الحالي من 4 أرقام قبل إعداد رقم جديد

# pleaseEnterNewPin
source: Please enter a new 4-digit PIN before setting up a new one
ar: الرجاء إدخال رقمك السري الجديد من 4 أرقام قبل إعداد رقم جديد

source: Confirm your new PIN?
ar: تأكيد رقمك السري الجديد

# startMakingVariousTransaction
source: You can start making various types of transactions in your account
ar: يمكنك إجراء مختلف أنواع المعاملات في حسابك

source: CONFIRM
ar: التأكيد

source: Branch Locator
ar: البحث عن فرع

source: Change PIN
ar: تغيير الرقم السري

source: Log out
ar: الخروج

source: Add nickname
ar: أضف اسم القرض

source: Change nickname
ar: تغيير اسم القرض

# removeNickNameQ
source: Remove nickname?
ar: حذف اسم القرض

source: Are you sure you want to log out?
ar: هل متأكد بأنك تريد الخروج؟

source: Proceed
ar: استمر

# otpLimitExceeded
source: OTP generation limit exceed please try again after 5 minutes
ar: لقد تجاوزت عدد مرات (OTP) المسموح بها، حاول مرة اخرى بعد 5 دقائق

# onlyExisting
source: Only existing customers are allowed to onboard
ar: يسمح فقط للعملاء الحاليين بالدخول

source: invalid id number
ar: رقم الهوية غير صحيح

# errorCifEnquiry
source: Something went wrong ,please try again (err-cifinq)
ar: (err-cifinq) حدث خطأ ما، يرجى المحاولة مرة أخرى

# existingCustomerNotAllowed
source: Existing customers are not allowed
ar: غير مسموح للعملاء الحاليين

source: Invalid OTP
ar: غير صحيح OTP

# otpExpired
source: OTP is expired
ar: انتهى صلاحية OTP

# pinNotMatchAPI
source: Pin is not valid for the user
ar: الرقم السري ليس صحيحا للمستخدم

# pinSaveError
source: Something went wrong ,please try again (ex-ps)
ar: (ex-ps) حدث خطأ ما، يرجى المحاولة مرة أخرى

# pinVerifyError
source: Something went wrong ,please try again (ex-vp)
ar: (ex-vp) حدث خطأ ما، يرجى المحاولة مرة أخرى

# pinAndConfirmPinNotMatch
source: Pin and confirm pin does not match
ar: الرقم السري وتأكيد الرقم السري غير متوافقان

# errorPreviousPin
source: Can't use last 10 pin.Try using some different pin combination
ar: لا يمكنك استخدام الأرقام السرية العشرة الأخيرة. حاول استخدام رقم سري بتركيبة أخرى

# pinNotSetUp
source: Pin not setup for this user on this device
ar: الرقم السري ليس لهذا المستخدم في هذا الجهاز

# errorPinLogin
source: Something went wrong ,please try again (ex-pl)
ar: (ex-pl) حدث خطأ ما، يرجى المحاولة مرة أخرى

# errorFirstBio
source: Something went wrong ,please try again (ex-fbi)
ar: (ex-fbi) حدث خطأ ما، يرجى المحاولة مرة أخرى

# errorGENERATEKEYPAIR
source: Something went wrong ,please try again (ex-gk)
ar: (ex-gk) حدث خطأ ما، يرجى المحاولة مرة أخرى

# genericError
source: Something went wrong ,please try again
ar: حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Invalid id details
ar: تفاصيل الهوية غير صحيحة

source: Available Balance
ar: الرصيد المتوفر

source: BHD
ar: د.ب

source: UNBILLED
ar: لم تصدر لها فاتورة

source: View Statement
ar: اطلع على كشف الحساب

source: Send to My Email
ar: ارسله الى بريدي الإلكتروني

# selectAction
source: SELECT ACTIONS
ar: اختر الإجراءات

# noTransactionToFound
source: No transactions to display
ar: ليس هناك معاملات للعرض

source: Unfreeze this card?
ar: إلغاء تجميد هذه البطاقة

# unfreezeThisCardEnableYourTransaction
source: Unfreezing this card enables you to do your transactions.
ar: إلغاء تجميد البطاقة يسمح لك بإجراء المعاملات

source: Re-issue card PIN?
ar: إعادة اصدار الرقم السري للبطاقة

# youWilBeChargedWithBHD
source: You wil be charged with 2.2 BHD (2 BHD + VAT ) Amount will be reflected on your next statement.
ar: سوف يخصم 10.000 د.ب وسوف تحتسب في كشف حسابك القادم

source: CHANGE NOW
ar: قم بالتغيير الآن

# temporaryPinHasBeenSentToYou
source: Temporary PIN has been sent to you. Would you like to change your PIN now?
ar: تم ارسال الرقم السري المؤقت اليك. هل ترغب في تغيير رقمك السري الآن؟

source: Settings
ar: الإعدادات

source: Stop card
ar: اوقف البطاقة

source: Why would you want to stop the card?
ar: لماذا تريد إيقاف البطاقة؟

source: Please select one reason
ar: الرجاء اختيار سبب واحد

source: REASON
ar: السبب

# stopCardDescription
source: This action can’t be undone via app. You will have to contact the call center in order to re-activate the card.
ar: لا يمكن إعادة تفعيل البطاقة من خلال التطبيق. يتوجب الذهاب الى أحد الفروع لإعادة تفعيل البطاقة

# receiveNotificationViaEmail
source: You will receive a notification via email and mobile number.
ar: سوف تستلم إشعار بواسطة البريد الإلكتروني والهاتف

source: Your card is stopped.
ar: بطاقتك موقوفة

source: LOCATE BRANCH
ar: ابحث عن فرع

source: Freeze this card?
ar: تجميد هذه البطاقة

source: Freezing this card will prevent you from doing any transactions.
ar: تجميد هذه البطاقة يمنعك من إجراء أي معاملات

# yourCardIsStoppedPleaseGoToNearestBranch
source: Your card is stopped. Please go to the nearest branch to re-activate your card.
ar: بطاقتك موقوفة، الرجاء التوجه إلى أقرب فرع لإعادة تفعيل بطاقتك

source: YES
ar: نعم

source: NO
ar: لا

# enterMobileNo
source: Please enter your mobile number
ar: الرجاء ادخال رقم هاتفك

# invalidCardId
source: Invalid internal card id
ar: هوية بطاقة داخلية غير صحيحة

source: Success.
ar: عملية ناجحة

source: Biometric login disabled
ar: تم إيقاف الدخول البايومتري

source: No Data Found
ar: لم يتم العثور على أي بيانات

source: TRANSACTION DETAILS
ar: تفاصيل المعاملة

# noActiveLoanYet
source: You don’t have any active loan, yet.
ar: ليس لديك أي قرض نشط بعد

# noLoanYetDesc
source: Get your first loan at the nearest branch. Soon, you will be able to apply right on your mobile app.
ar: احصل على أول قرض لك من أقرب فرع. سوف تتمكن قريبا من تقديم طلب عبر تطبيق هاتفك المتنقل مباشرة

source: LOCATE US
ar: ابحث عنا

# invalidResendTypeError
source: Invalid OTP resent Type
ar: OTP غير صحيح، اطلب إعادة الإرسال

# err_0005
source: Device id is required
ar: يتطلب رقم هوية الجهاز

# err_164
source: Version not found
ar: لم يتم العثور على نسخة البرنامج

# ex121
source: Something went wrong ,please try again (ex-121)
ar: (ex-121) حدث خطأ ما، يرجى المحاولة مرة أخرى

# dto_0000
source: Base class is required
ar: الفئة الأساسية مطلوبة

# dto_0147
source: Unique Id is required
ar: مطلوب الرقم المتميز

source: Id number is required
ar: رقم الدخول مطلوب

source: Otp type not configured in database
ar: نوع ال OTP غير مدرج في قاعدة البيانات

# ex_0002
source: Something went wrong ,please try again (ex-0002)
ar: حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Is business user flag is required
ar: هل يتطلب شارة المستخدم التجاري

source: OTP code is required
ar: مطلوب رمز OTP

# ex_0022
source: Something went wrong ,please try again (ex-0022)
ar: ex_0022 حدث خطأ ما، يرجى المحاولة مرة أخرى

# use_you_must_be_existing_customer
source: In order to use you must be existing customer
ar: لكي تتمكن من الاستخدام، يجب أن تكون عميلا في الوقت الحاضر

source: CoolOff time for OTP is actviated
ar: وقت التهدئة ليتم تفعيل رمز otp

source: OTP already verified
ar: تم التحقق بالفعل من رمز OTP

source: Pin is requried
ar: الرقم السري مطلوب

source: invalid pin only numbers are allowed
ar: رقم سري غير صحيح، فقط الأرقام مسموحا بها

# ex_164
source: Something went wrong ,please try again (ex-164)
ar: (ex-164) حدث خطأ ما، يرجى المحاولة مرة أخرى

# verify_token_error
source: Something went wrong ,please try again (ex-vt)
ar: (ex-vt) حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Pin is expired
ar: الرقم السري منتهي الصلاحية

source: Confirm pin is requried
ar: تأكيد أن الرقم السري مطلوب

source: Invalid pin length
ar: طول الرقم السري غير صحيح

# loan_dashboard_error
source: Something went wrong ,please try again (ex-ld)
ar: (ex-ld) حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Internal id is requried
ar: رقم التعرف الداخلي مطلوب

source: Transaction type is required
ar: نوع المعاملة مطلوب

# card_transaction_ungroup_error
source: Something went wrong ,please try again (ex-ctug)
ar: (ex-ctug) حدث خطأ ما، يرجى المحاولة مرة أخرى

# error_card_statement_error
source: Something went wrong ,please try again (ex-cs)
ar: (ex-cs) حدث خطأ ما، يرجى المحاولة مرة أخرى

# loan_transaction_error
source: Something went wrong ,please try again (ex-ls)
ar: (ex-ls) حدث خطأ ما، يرجى المحاولة مرة أخرى

# invalid_internal_loan_id_error
source: Invalid internal loan id
ar: رقم تعريف القرض الداخلي غير صحيح

# error_loan_statement_error
source: Something went wrong ,please try again (ex-lst)
ar: (ex-lst) حدث خطأ ما، يرجى المحاولة مرة أخرى

# loan_transaction_g_error
source: Something went wrong ,please try again (ex-lsg)
ar: (ex-lsg) حدث خطأ ما، يرجى المحاولة مرة أخرى

# card_transaction_group_error
source: Something went wrong ,please try again (ex-ctg)
ar: (ex-ctg) حدث خطأ ما، يرجى المحاولة مرة أخرى

# statement_dates_error
source: Something went wrong ,please try again (ex-csd)
ar: (ex-csd) حدث خطأ ما، يرجى المحاولة مرة أخرى

# card_statement_error
source: Something went wrong ,please try again (ex-cst)
ar: (ex-cst) حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Card Status is required
ar: حالة البطاقة مطلوبة

# card_status_change_error
source: Something went wrong ,please try again (ex-csc)
ar: (ex-csc) حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Invalid card status
ar: حالة بطاقة غير صحيحة

# update_nickname_card_error
source: Something went wrong ,please try again (ex-nc)
ar: (ex-nc) حدث خطأ ما، يرجى المحاولة مرة أخرى

# nickname_loan_error
source: Something went wrong ,please try again (ex-nl)
ar: (ex-nl) حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Cipher is required
ar: مطلوب التشفير

source: Public key is required
ar: المفتاح العام مطلوب

# enable_bio_error
source: Something went wrong ,please try again (ex-eb)
ar: (ex-eb) حدث خطأ ما، يرجى المحاولة مرة أخرى

# dto_0147s
source: Something went wrong ,please try again (ex-eb)
ar: (ex-eb) حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Biometric not setup for this user on this device
ar: لا يوجد إعدادات بايومترية لهذا المستخدم على هذا الجهاز

# bio_login_error
source: Something went wrong ,please try again (ex-bl)
ar: (ex-bl) حدث خطأ ما، يرجى المحاولة مرة أخرى

# ex_144a
source: Something went wrong ,please try again (ex-bst)
ar: (ex-bst) حدث خطأ ما، يرجى المحاولة مرة أخرى

source: New pin is required
ar: مطلوب رقم سري جديد

# change_pin_error
source: Something went wrong ,please try again (ex-cp)
ar: (ex-cp) حدث خطأ ما، يرجى المحاولة مرة أخرى

# branch_list_error
source: Something went wrong ,please try again (ex-bls)
ar: (ex-bls)) حدث خطأ ما، يرجى المحاولة مرة أخرى

# dto_0052
source: Id number is required
ar: (ex-nc) حدث خطأ ما، يرجى المحاولة مرة أخرى

# forgot_pin_send_otp_error
source: Something went wrong ,please try again (ex-fps)
ar: (ex-nc) حدث خطأ ما، يرجى المحاولة مرة أخرى

# forgot_pin_resend_otp_error
source: Something went wrong ,please try again (ex-frsp)
ar: (ex-frps) حدث خطأ ما، يرجى المحاولة مرة أخرى

# verify_forgot_pin_error
source: Something went wrong ,please try again (ex-vfp)
ar: (ex-vfp) حدث خطأ ما، يرجى المحاولة مرة أخرى

# code_is_requried_error
source: Code is required
ar: الرمز مطلوب

# change_forgot_pin_error
source: Something went wrong ,please try again (ex-cfp)
ar: (ex-cfp) حدث خطأ ما، يرجى المحاولة مرة أخرى

# invalid_code_error
source: Invalid code
ar: رمز خاطيء

# locationServiceDisabled
source: Location services are disabled. Please allow access to BCFC
ar: خدمات الموقع غير مفعلة. يرجى السماح للتطبيق

source: Your Credit Limit
ar: سقفك الإئتماني

source: Your Cash Limit
ar: سقفك النقدي

# outstandBalance
source: Outstanding Balance
ar: الرصيد المستحق

source: Min. Payment
ar: الحد الإدنى للدفع

source: Last Payment
ar: آخر دفعة

source: Overdue Amount
ar: مبلغ متخلف عن الدفع
