Repository: MahendraNeoGit/flutter_assignment
Catalog: lib/l10n/intl_*.arb
Languages: ar

# temporaryPinSent
source: Temporary PIN has been sent to you.
ar: تم ارسال الرقم السري المؤقت

source: Total Available Limit
ar: مجموع الحد المتوفر

# dueOn
source: Due on {String}
ar: مستحق في

source: Service Paid
ar: تم الدفع مقابل الخدمة

source: back to dashboard
ar: العودة إلى الرئيسية

source: Your payment is unsuccessful!
ar: الدفع غير ناجح

source: Enter loan nickname
ar: ادخل الاسم المختصر للقرض

# successfullyChangedPin
source: You have successfully changed your PIN.
ar: تم تغيير الرقم السري بنجاج

# notificationWillBeSentToMN
source: Notification will be send to your linked mobile number.
ar: سوف يرسل اشعار الى الرقم الخاص بك

# successfullyChangeCardPin
source: You have successfully changed your card PIN.
ar: تم تغيير الرقم السري للبطاقة بنجاح

# pleaseCallToUpdate
source: Please Contact Our Contact Center To Get Your Mobile Number Updated.
ar: يرجى الاتصال لتحديث معلوماتك

source: Update Phone Number
ar: تحديث رقم الهاتف

source: CALL NOW
ar: اتصل الآن

# loanTransactionEmpty
source: You haven’t made any payment on your loan, yet.
ar: لا يوجد معاملات لهذا القرض

source: Resend Code
ar: اعد ارسال الرمز

source: No credit card available
ar: لا تتوفر بطاقة ائتمان

# noCCAvailableDesc
source: You don’t have any credit card accounts at the moment
ar: ليس لديك أي حسابات بطاقات ائتمان في الوقت الحالي

# transactionStatementEmpty
source: There is no available transaction in this time period. You may check other dates.
ar: كلا توجد معاملات متاحة في هذه الفترة الزمنية. يمكنك التحقق من تواريخ أخرى.

# cardTransactionEmpty
source: You haven’t made any transaction yet.
ar: لم تجرِ أي معاملة حتى الآن.

# unauthorizedUser
source: Session Timeout
ar: مستخدم غير مصرح له

# accountSuspended
source: Account is lock for one hour
ar: الحساب موقوف

source: Pay Loan
ar: ادفع القرض

source: Last Payment Date
ar: آخر تاريخ للدفع

# vendorIdRequired
source: Vendor Id is required
ar: مطلوب رقم البائع

# accountType
source: Account Type is required
ar: نوع الحساب مطلوب

# amtRequired
source: Amount is required
ar: المبلغ مطلوب

# amtGreaterThanLimit
source: Amount is greater than limit
ar: المبلغ أكبر من السقف المحدد

# amtLessThanMinimumAllowed
source: Amount is less than minimum allowed
ar: المبلغ أقل من الحد الأدنى المسموح به

source: Invalid vendor id
ar: رقم بائع غير صحيح

source: Invalid Account Type
ar: نوع حساب غير صحيح

source: Invalid Payment Id
ar: رقم هوية دفع غير صحيح

# errorInvalidPaymentId
source: Invalid vendor id
ar: خطأ. رقم هوية دفع غير صحيح

# paymentIdEmpty
source: Payment id is empty
ar: رقم هوية الدفعة فاضي

# vendorNotAllowedTypeLoan
source: Vendor not allowed for this type of loan
ar: نوع القرض غير مقبول من الباعة

# vendorNotAllowedTypeCard
source: Vendor not allowed for this type of card
ar: نوعية بطاقة غير مقبولة من الباعة

# validateCustomer
source: Something went wrong ,please try again (ex-vc)
ar: (ex-vc) حدث خطأ ما، يرجى المحاولة مرة أخرى

# informationNotValidated
source: Info not validated
ar: لم يتم التحقق من المعلومات

# inquiry
source: Something went wrong ,please try again (ex-inq)
ar: (ex-inq) حدث خطأ ما، يرجى المحاولة مرة أخرى

# somethingWentWrong
source: Something went wrong ,please try again (ex-897)
ar: (ex-897) حدث خطأ ما، يرجى المحاولة مرة أخرى

# idRequired
source: Id is required
ar: مطلوب رقم الهوية

# keyExpire
source: key is expire
ar: انتهى مدة المفتاح

# errorCardData
source: Something went wrong ,please try again (ex-crd)
ar: (ex-crd) حدث خطأ ما، يرجى المحاولة مرة أخرى

# fingerNotVerified
source: Finger print not verified
ar: لم يتم التحقق من بصمات الإصبع

# errorLogout
source: Something went wrong ,please try again (ex-lg)
ar: (ex-lg) حدث خطأ ما، يرجى المحاولة مرة أخرى

source: Download loan statement
ar: تحميل كشف القرض

source: PAY NOW
ar: ادفع الآن

source: Swipe left to pay
ar: مرر لليسار للدفع

# cardFreezed
source: Card is freezed successfully.
ar: تم تجميد البطاقة بنجاح

# cardUnFreezed
source: Card is unfreezed successfully.
ar: تم رفع تجميد البطاقة بنجاح

# emptyStatement
source: Statement data is empty.
ar: بيانات كشف الحساب فارغة

# zeroAmount
source: Amount Cannot be 0
ar: لا يمكن أن يكون المبلغ صفراً

# lessThanFive
source: Minimum Payment Amount BHD 5
ar: الحد الأدنى للدفع 5 دينار

# amountCannotBeGreater
source: Payment amount cannot be greater than {String}
ar: لا يمكن أن يكون مبلغ الدفع أكبر من {string}

# pleaseEnterOrConfirmEmailAddress
source: Please enter or confirm your email address
ar: الرجاء ادخال بريدك الالكتروني أو تأكيده

source: Email Address
ar: البريد الالكتروني

# emailProofHint
source: Hint: You can specify more than one email id separated by semicolon (;).
ar: ملحوظة

source: Hold
ar: انتظر

# currentText
source: Current
ar: كشف الحساب الحالي

source: Previous
ar: كشف الحساب السابق

source: Last Statement
ar: أخر كشف حساب

source: Transaction Amount
ar: مبلغ المعاملة

source: Transaction Date
ar: تاريخ المعاملة

source: Processing Date
ar: تاريخ المعالجة

source: Transaction Time
ar: وقت المعاملة

source: Card Number
ar: رقم البطاقة

source: Status
ar: الحالة

source: VAT
ar: ضريبة القيمة المضافة

source: Running Balance
ar: الرصيد الحالي

source: Card Statement
ar: كشف الحساب
